//
// Created by Dule on 1/27/2023.
//
#include <stdio.h>

/*Да се напише функциска програма што како влезен аргумент прима низа од знаци. Функцијата
треба да изврши трансформација на влезната низа така што елементите од втората половина ќе се
ископираат на местото на елементите од првата половина како во примерите. Доколку низата има
непарен број на елементи, средниот елемент останува на истата позиција.
Пример: низата 2 8 7 6 5 3 4 се трансформира во 5 3 4 6 5 3 4
 низата 3 5 4 2 8 1 се трансформира во 2 8 1 2 8 1 */
#include <string.h>
#define MAX 100
void promena(char *a)
{
int i, n=strlen(a), r=(n+1)/2;
for (i=0;i<n/2;i++)
{
(*(a+i))=(*(a+i+r));
}
}
int main ()
{
char niza[MAX];
printf("Vnesi niza od znaci:\n");
gets(niza);
promena(niza);
printf("\nNovata niza e:\n");
puts(niza);
return 0;
}
