#include <stdio.h>
/*Да се напише програма која дадена матрица ќе ја измени на начин, со тоа што елемнтите од
споредната дијагонала ќе имаат вредност еднаква на сумата на „жолтите“ полиња (обелжани на
сликат со правоаголник). Останатите полиња ќе останат непроменети. На крај да се отпечати
новодобиената матрица. Максималната димензија на матрицата е 10 x 10. */
#define MAX 10
int main ()
{
    int n;
    int p=0,q;
    scanf("%d",&n);
    int niza[MAX][MAX];
    for (int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            scanf("%d",&niza[i][j]);

        }

    }
    for (int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            if((i+j)%2==0) {
                p+=niza[i][j];
            }

        }

    }
    printf("%d\n",p);
    for (int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            if((i+j)==n-1)
                printf("%d ",p);
            else
                printf("%d ",niza[i][j]);

        }
        printf("\n");
    }

    return 0;
}
