//
// Created by Dule on 2/9/2023.
//
#include <stdio.h>
#include <string.h>
#define MAX 100
/*За квадратна матрица A со димензии n x n, од стандарден влез се внесува
бројот n (n >=2) и елементите на матрицата (реални броеви). Нека X e збирот од
елементите под главната дијагонала во матрицата А. Нека Y е збирот од елементите под споредната дијагонала во матрицата А. Да се креира нова
матрица B на следниот начин:
• сите елементи од главната дијагонала во матрицата B треба да имаат
вредност X
• сите елементи од споредната дијагонала во матрицата B треба да имаат
вредност Y
• ако даден елемент припаѓа и на главната и на споредната дијагонала во
матрицата B, тогаш неговата вредност e X+Y
• сите останати елементи во матрицата B имаат вредност 0
Новата матрица B да се испечати на стандарден излез.

*/

int main(){
    int niza[MAX][MAX];
    int n,x=0,y=0;
    scanf("%d",&n);
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            scanf("%d",&niza[i][j]);
        }


    }
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            if(i>j)
                x+=niza[i][j];

        }


    }
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            if((i+j)>=n)
                y+=niza[i][j];

        }


    }

    for(int i=0;i<n;i++){

        for(int j=0;j<n;j++){
            if((i==j)&& (i+j==n-1))
                printf("%d ",x+y);
            else  if(i==j)
                printf("%d ",x);
            else if(i+j==n-1){
                printf("%d ",y);
            }

            else
                printf("%d ",0);

        }
        printf("\n");


    }



    return 0;
}
