//
// Created by Dule on 1/23/2023.
//
#include <stdio.h>
/*Да се напише програма која дадена квадратна матрица ќе ја измени на начин, со тоа што
елементите од главната дијгонала ќе имат вредност еднаква на сумата на „жолтите“ полиња
(обелжани на сликат со круг). Останатите полиња ќе останат непроменети. На крај да се отпечати
новодобиената матрица. Максималната димензија на матрицата е 10 x 10*/
#define MAX 10
int main ()
{
    int n;
    int p=0,q;
    scanf("%d",&n);
    int niza[MAX][MAX];
    for (int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            scanf("%d",&niza[i][j]);

        }

    }
    for (int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            if((i+j)%2!=0) {
                p+=niza[i][j];
            }

        }

    }
    for (int i=0;i<n;i++){
        if(niza[i][i]){
            niza[i][i]=p;
        }
        for(int j=0;j<n;j++){
            printf("%d ",niza[i][j]);

        }
        printf("\n");
    }

    return 0;
}
