//
// Created by Dule on 1/25/2023.
//
#include <stdio.h>
#include <stdlib.h>
#define max 100
/*Д.
.. Да се напише програма што ќе јa прочита содржината на една текстуална низа што завршува со
точка (‘.’). Читањето се врши знак по знак. На комјутерскиот екран да се прикажат само цифрите од
прочитаната низа. Задачат да се реши без користење на низа од знаци (string). */

int main()
{
    char c;
    while((c=getchar())!=EOF){
        if(c=='.') break;
        else if(isdigit(c)){
            putchar(c);
        }
    }



    return 0;
}
